import { HomePageWrapper } from './HomePage.styled';
import Layout from '../../components/Layout/Layout';

export const Home = () => {
  return (
    <Layout>
      <HomePageWrapper>
        <h1 className="text-home">
          Ласкаво просимо до нашої компанії з надання автомобілів в оренду в
          Україні!
        </h1>

        <ul className="list-about-us">
          <li>
            <h2>Про нас</h2>
            <p>
              Наша компанія - це впізнаваний лідер у сфері оренди автомобілів,
              що працює на ринку України. Ми спеціалізуємося на наданні
              високоякісних послуг оренди автомобілів різних класів та марок,
              від малолітражних автомобілів до представницьких лімузинів.
            </p>
          </li>
          <li>
            <h2>Наша місія</h2>
            <p>
              Ми прагнемо забезпечити наших клієнтів найвищою якістю
              обслуговування та індивідуальним підходом до кожного. Наша місія -
              забезпечити зручний, безпечний та надійний спосіб оренди
              автомобіля, щоб кожен наш клієнт відчував комфорт та впевненість
              на дорозі.
            </p>
          </li>
        </ul>

        <div>
          <h3>Як замовити автомобіль</h3>

          <p>
            Наша команда професіоналів завжди готова вам допомогти. Ми надаємо
            консультації з вибору автомобіля, допомагаємо з укладенням угоди та
            відповідаємо на всі ваші питання. Наш мета - забезпечити вам
            найкращий досвід в оренді автомобіля.
          </p>
          <p>
            Замовити автомобіль від нашої компанії легко. Ви можете зробити це
            онлайн через наш веб-сайт або зв'язатися з нашими менеджерами за
            вказаними контактними даними. Ми гарантуємо швидке та зручне
            оформлення оренди.
          </p>
        </div>
      </HomePageWrapper>
    </Layout>
  );
};

export default Home;
