import { HomePageWrapper } from './HomePage.styled';
import Layout from '../../components/Layout/Layout';

export const Home = () => {
  return (
    <Layout>
      <HomePageWrapper>
        <h1 className="text-home">
          Ласкаво просимо до нашої компанії з надання автомобілів в оренду в
          Україні!
        </h1>

        <ul className="list-about-us">
          <li>
            <h2>Про нас</h2>
            <p>
              Наша компанія - це впізнаваний лідер у сфері оренди автомобілів,
              що працює на ринку України. Ми спеціалізуємося на наданні
              високоякісних послуг оренди автомобілів різних класів та марок,
              від малолітражних автомобілів до представницьких лімузинів.
            </p>
          </li>
          <li>
            <h2>Наша місія</h2>
            <p>
              Ми прагнемо забезпечити наших клієнтів найвищою якістю
              обслуговування та індивідуальним підходом до кожного. Наша місія -
              забезпечити зручний, безпечний та надійний спосіб оренди
              автомобіля, щоб кожен наш клієнт відчував комфорт та впевненість
              на дорозі.
            </p>
          </li>
        </ul>

        <div className="details">
          <h3>Як замовити автомобіль</h3>

          <p>
            Наша команда професіоналів завжди готова вам допомогти. Ми надаємо
            консультації з вибору автомобіля, допомагаємо з укладенням угоди та
            відповідаємо на всі ваші питання. Наш мета - забезпечити вам
            найкращий досвід в оренді автомобіля.
          </p>
          <p>
            Замовити автомобіль від нашої компанії легко. Ви можете зробити це
            онлайн через наш веб-сайт або зв'язатися з нашими менеджерами за
            вказаними контактними даними. Ми гарантуємо швидке та зручне
            оформлення оренди.
          </p>
        </div>

        <div>
          <h4 className="users-details">Для користувачів</h4>
          <ul className="list-users-details">
            <li>
              <p>
                Наш вибір автомобілів - це твій крок до незабутнього досвіду на
                дорозі! Ми ретельно відібрали кожен автомобіль, щоб забезпечити
                вам найвищий рівень комфорту та задоволення від поїздки.
              </p>
            </li>
            <li>
              <p>
                Коли ви обираєте автомобіль у нас, ви обираєте якість, безпеку і
                стиль. Наші автомобілі представляють собою справжню комбінацію
                передових технологій, елегантного дизайну та високої
                продуктивності. Кожен автомобіль проходить ретельну перевірку та
                технічне обслуговування, щоб ви могли насолоджуватися кожним
                моментом своєї подорожі.
              </p>
            </li>
            <li>
              <p>
                З нами ви можете обрати автомобіль, який відповідає вашим
                унікальним потребам та вподобанням. Від економічних моделей для
                ефективних міських поїздок до представницьких лімузинів для
                особливих випадків - ми маємо все!
              </p>
            </li>
            <li>
              <p>
                Ваша подорож починається з вибору ідеального автомобіля, і ми
                тут, щоб зробити цей вибір легким та приємним. Довіртеся нам, і
                ми зробимо все можливе, щоб ваша поїздка стала найкращою
                частиною вашого дня!
              </p>
            </li>
            <li>
              <p>
                Ми розуміємо змінні потреби наших клієнтів, тому пропонуємо
                гнучкі умови оренди, щоб ви відчували себе комфортно.
              </p>
            </li>{' '}
            <li>
              <p>
                Ми приділяємо велику увагу безпеці, забезпечуючи найновітніші
                системи та технології безпеки.
              </p>
            </li>
            <li>
              <p>
                Кожен автомобіль відзначається вишуканим дизайном та інтер'єром,
                щоб ваша поїздка була стильною та комфортною.
              </p>
            </li>
            <li>
              <p>
                Наші автомобілі оснащені передовими системами управління, що
                забезпечують легке та точне керування для вашої безпеки.
              </p>
            </li>
          </ul>
        </div>
      </HomePageWrapper>
    </Layout>
  );
};

export default Home;
